## Concat

In [7]:
import pandas as pd
import numpy as np

In [8]:
#columnler aynı olursa birlerştimeyi saglıyor

In [9]:
f={"isim":["john","uma"],
  "not":["bb","cc"],
  "ders":["matematik","biyoloji"]}

In [10]:
dataF=pd.DataFrame(f)

In [11]:
dataF

   isim not       ders
0  john  bb  matematik
1   uma  cc   biyoloji

In [12]:
h={"isim":["jess","leila"],
  "not":["dd","aa"],
  "ders":["istatistik","ekonomi"]}

In [13]:
dataF1=pd.DataFrame(h)

In [14]:
pd.concat([dataF,dataF1])

    isim not        ders
0   john  bb   matematik
1    uma  cc    biyoloji
0   jess  dd  istatistik
1  leila  aa     ekonomi

## merge

In [15]:
j={"isim":["jess","leila"],
  "sport":["volleyball","basketball"],
  "bolum":["istatistik","ekonomi"]}

In [21]:
k={"isim":["jess","leila"],
  "yas":[22,18]}

In [22]:
jDa=pd.DataFrame(j)

In [23]:
kDa=pd.DataFrame(k)

In [24]:
pd.merge(jDa,kDa,on="isim")

    isim       sport       bolum  yas
0   jess  volleyball  istatistik   22
1  leila  basketball     ekonomi   18

## İleri Fonksiyonlar

In [25]:
#tekrar etmeyenlerden

In [32]:
e={"isim":["jess","leila","jamie","robert"],
  "sport":["volleyball","basketball","box","box"],
  "bolum":["istatistik","ekonomi","mimarlık","mühendislik"]}

In [33]:
eDa=pd.DataFrame(e)

In [34]:
eDa

     isim       sport        bolum
0    jess  volleyball   istatistik
1   leila  basketball      ekonomi
2   jamie         box     mimarlık
3  robert         box  mühendislik

In [37]:
eDa["sport"].unique()

array(['volleyball', 'basketball', 'box'], dtype=object)

In [38]:
eDa["sport"].nunique()

3

In [39]:
eDa["sport"].value_counts()

box           2
basketball    1
volleyball    1
Name: sport, dtype: int64

In [41]:
#pivotlar----> farklı tablolarda

In [49]:
d={"karakter":["blackwidow","superman","flash"],
   "isim":["natasha","paul","barny"],
  "yas":[32,50,32]}

In [50]:
dDat=pd.DataFrame(d)

In [51]:
dDat

     karakter     isim  yas
0  blackwidow  natasha   32
1    superman     paul   50
2       flash    barny   32

In [46]:
#aynı multi table gibi pivot ozelligi